li59533/YE5955_WiFi/code/stm32l4xx/stm32l4xx/projects/stm32l4xx/source/fml/app_datasend.c
	return 0 ; 
}



int8_t APP_Report_ChannelKind(uint8_t channel_type)   // 
{
	
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_ChannelKind\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_CHANNELKIND;
			sendbuf_ptr[2] = 0x06;
			sendbuf_ptr[3] = 0x00;
			
			sendbuf_ptr[4] = g_SystemParam_Param.acceleration_adchs + g_SystemParam_Param.temp_adchs; //两个，一个温度一个加速度
			sendbuf_ptr[5] = 0x02;  //这一块，每种传感器手工添加
			sendbuf_ptr[6] = 0x01;
			sendbuf_ptr[7] = g_SystemParam_Param.acceleration_adchs;
			sendbuf_ptr[8] = 0x02;
			sendbuf_ptr[9] = g_SystemParam_Param.temp_adchs;
			sendbuf_ptr[10] = 0;
			for(uint16_t i = 1 ; i < 10 ;i ++)
			{
				sendbuf_ptr[10] += sendbuf_ptr[i];
			}
			
			sendbuf_ptr[11] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 12;

			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
			
			
		}
		else
		{
			DEBUG("ESP32_GetWorkSpace is NULL\r\n");
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}


int8_t APP_Report_ID(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_ID\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_SNCODE;
			sendbuf_ptr[2] = 0x08;
			sendbuf_ptr[3] = 0x00;
			sendbuf_ptr[4] = g_SystemParam_Config.SNnumber[0];
			sendbuf_ptr[5] = g_SystemParam_Config.SNnumber[1];
			sendbuf_ptr[6] = g_SystemParam_Config.SNnumber[2];
			sendbuf_ptr[7] = g_SystemParam_Config.SNnumber[3];
			sendbuf_ptr[8] = g_SystemParam_Config.SNnumber[4];
			sendbuf_ptr[9] = g_SystemParam_Config.SNnumber[5];
			sendbuf_ptr[10] = g_SystemParam_Config.SNnumber[6];
			sendbuf_ptr[11] = g_SystemParam_Config.SNnumber[7];
			sendbuf_ptr[12] = 0;
			for(uint16_t i = 1;i < 12;i ++)
			{
				sendbuf_ptr[12] += sendbuf_ptr[i];
			}
			
			sendbuf_ptr[13] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 14;

			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}



int8_t APP_Report_Version(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_Version\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			char * version_ptr = 0;
			
			version_ptr = Version_Get_Str();
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;	
			sendbuf_ptr[1] = LN_P_R_VERSION;	
			sendbuf_ptr[2] = 0x10;
			sendbuf_ptr[3] = 0x00;
			for(uint32_t i = 0;i < 16;i++) //strcpy
			{
				sendbuf_ptr[4+i] = version_ptr[i];
			}
			sendbuf_ptr[20] = 0;
			for(uint32_t i = 1;i < 20;i++) //strcpy
			{
				sendbuf_ptr[20] += sendbuf_ptr[i];
			}
			sendbuf_ptr[21] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 22;

			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}

int8_t APP_Report_ChannelCondition(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_ChannelCondition\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
		
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_CHANNELCONDITION;
			sendbuf_ptr[2] = 0x02;
			sendbuf_ptr[3] = 0x00;
			sendbuf_ptr[4] = g_SystemParam_Config.DataToSendChannel; //两个，一个温度一个加速度

			sendbuf_ptr[5] = 0x00;//config.DataToSendChannel>>8;
			sendbuf_ptr[6] = 0;
			for(uint16_t i = 1;i < 6;i++)
			{
				sendbuf_ptr[6] += sendbuf_ptr[i];
			}


			sendbuf_ptr[7] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 8;

			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}


int8_t APP_Report_SampleParam(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_SampleParam\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_SAMPLEPARAM;
			sendbuf_ptr[2] = 0x0B;
			sendbuf_ptr[3] = 0x00;
			sendbuf_ptr[4] = g_SystemParam_Config.ADfrequence; //两个，一个温度一个加速度

			sendbuf_ptr[5] = g_SystemParam_Config.ADfrequence >> 8;
			sendbuf_ptr[6] = g_SystemParam_Config.ADfrequence >> 16; //两个，一个温度一个加速度

			sendbuf_ptr[7] = g_SystemParam_Config.ADfrequence >> 24;
			sendbuf_ptr[8] = g_SystemParam_Config.ADtime;
			sendbuf_ptr[9] = g_SystemParam_Config.PeriodTransimissonCounter;
			sendbuf_ptr[10] = g_SystemParam_Config.PeriodTransimissonCounter >> 8;
			sendbuf_ptr[11] = (uint8_t)g_SystemParam_Config.PeriodTransimissonStatus;

			sendbuf_ptr[12] = g_SystemParam_Config.workcycleseconds;
			sendbuf_ptr[13] = g_SystemParam_Config.workcycleseconds>>8;
			sendbuf_ptr[14] = (uint8_t)g_SystemParam_Config.ParameterTransimissonStatus;
			sendbuf_ptr[15] = 0;
			for(uint16_t i = 1;i < 15;i++)
			{
				sendbuf_ptr[15] += sendbuf_ptr[i];
			}

			sendbuf_ptr[16] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 17;

			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}


int8_t APP_Report_APinf(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_APinf\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			uint8_t APSSIDlength = strlen(g_SystemParam_Config.APssid);
			uint8_t APPASSWORDlength = strlen(g_SystemParam_Config.APpassword);

			sendbuf_len = 10 + APSSIDlength+APPASSWORDlength;
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_APINF;   //T
			sendbuf_ptr[2] = sendbuf_len - 6;
			sendbuf_ptr[3] = (sendbuf_len - 6) >> 8;   //L
			sendbuf_ptr[4] = 0X00;   //V_IP
			sendbuf_ptr[5] = APSSIDlength;
			
			for(uint8_t i = 0;i < APSSIDlength;i ++)
			{
				sendbuf_ptr[6 + i] = g_SystemParam_Config.APssid[i];
			}

