li59533/YE5955_WiFi/code/stm32l4xx/stm32l4xx/projects/stm32l4xx/source/fml/app_datasend.c
			sendbuf_ptr[6 + APSSIDlength] = 0X01;   //V_MASK
			sendbuf_ptr[7 + APSSIDlength] = APPASSWORDlength;
			
			for(uint8_t i = 0;i < APPASSWORDlength;i++)
			{
				sendbuf_ptr[8 + APSSIDlength+i] = g_SystemParam_Config.APpassword[i];
			}
			
			sendbuf_ptr[8 + APSSIDlength + APPASSWORDlength] = 0X00;   //校验和

			for(uint8_t i = 1;i < (8 + APSSIDlength + APPASSWORDlength);i ++)
			{
				sendbuf_ptr[8 + APSSIDlength + APPASSWORDlength] += sendbuf_ptr[i];//把AP字符串赋值给config
			}
			
			sendbuf_ptr[9 + APSSIDlength + APPASSWORDlength] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 10 + APSSIDlength + APPASSWORDlength;			

			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}




int8_t APP_Report_TCPServer(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_TCPServer\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			uint8_t TcpServer_IPlength=strlen(g_SystemParam_Config.TcpServer_IP);
			uint8_t TcpServer_Portlength=strlen(g_SystemParam_Config.TcpServer_Port);
			sendbuf_len = 10 + TcpServer_Portlength + TcpServer_IPlength;
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_TCPSERVER;   //T
			sendbuf_ptr[2] = sendbuf_len-6;
			sendbuf_ptr[3] = (sendbuf_len-6)>>8;   //L
			sendbuf_ptr[4] = 0X00;   //V_IP
			sendbuf_ptr[5] = TcpServer_IPlength;
			{
			for(uint8_t i = 0;i < TcpServer_IPlength;i ++)
			sendbuf_ptr[6 + i] = g_SystemParam_Config.TcpServer_IP[i];

			}
			sendbuf_ptr[6 + TcpServer_IPlength] = 0X01;   //V_MASK
			sendbuf_ptr[7 + TcpServer_IPlength] = TcpServer_Portlength;
			{
			for(uint8_t i = 0;i < TcpServer_Portlength;i ++)
			sendbuf_ptr[8 + TcpServer_IPlength + i] = g_SystemParam_Config.TcpServer_Port[i];

			}
			sendbuf_ptr[8 + TcpServer_IPlength + TcpServer_Portlength] = 0X00;   //校验和

			for(uint8_t i = 1;i < (8 + TcpServer_IPlength + TcpServer_Portlength);i ++)
			sendbuf_ptr[8 + TcpServer_IPlength + TcpServer_Portlength] += sendbuf_ptr[i];//把AP字符串赋值给config
			sendbuf_ptr[9 + TcpServer_IPlength + TcpServer_Portlength] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 10 + TcpServer_IPlength + TcpServer_Portlength;			
			
			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}




int8_t APP_Report_RunMode(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_RunMode\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_RUNMODE;
			sendbuf_ptr[2] = 0x01;
			sendbuf_ptr[3] = 0x00;
			sendbuf_ptr[4] = g_SystemParam_Config.DataToBoardMode; //两个，一个温度一个加速度

			sendbuf_ptr[5] = 0;
			for(uint16_t i = 1;i < 5;i++)
			{
				sendbuf_ptr[5] += sendbuf_ptr[i];	
			}
				 
			sendbuf_ptr[6] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 7;
			
			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}


int8_t APP_Report_IPinf(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_IPinf\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			uint8_t localIPlength = strlen(g_SystemParam_Config.LocalIP);
			uint8_t LocalMASKlength = strlen(g_SystemParam_Config.LocalMASK);
			uint8_t LocalGATEWAYlength = strlen(g_SystemParam_Config.LocalGATEWAY);
			sendbuf_len = 15 + localIPlength + LocalMASKlength + LocalGATEWAYlength;
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_IPINF;   //T
			sendbuf_ptr[2] = sendbuf_len - 6;
			sendbuf_ptr[3] = (sendbuf_len - 6) >> 8;   //L
			sendbuf_ptr[4] = 0X00;   //V_IP
			sendbuf_ptr[5] = localIPlength;
			
			for(uint8_t i=0;i<localIPlength;i++)
			{
				sendbuf_ptr[6+i] = g_SystemParam_Config.LocalIP[i];
			}
			
			sendbuf_ptr[6 + localIPlength] = 0X01;   //V_MASK
			sendbuf_ptr[7 + localIPlength] = LocalMASKlength;
			
			for(uint8_t i = 0;i < LocalMASKlength;i++)
			{
				sendbuf_ptr[8 + localIPlength + i] = g_SystemParam_Config.LocalMASK[i];
			}
			
			sendbuf_ptr[8 + localIPlength + LocalMASKlength] = 0X02;   //V_GATEWAY
			sendbuf_ptr[9 + localIPlength + LocalMASKlength] = LocalGATEWAYlength;
			
			for(uint8_t i = 0;i < LocalGATEWAYlength;i ++)
			{
				sendbuf_ptr[10 + localIPlength + LocalMASKlength + i] = g_SystemParam_Config.LocalGATEWAY[i];
			}
			
			sendbuf_ptr[10 + localIPlength + LocalMASKlength + LocalGATEWAYlength] = 0X03;
			sendbuf_ptr[11 + localIPlength + LocalMASKlength + LocalGATEWAYlength] = 0X01;
			sendbuf_ptr[12 + localIPlength + LocalMASKlength + LocalGATEWAYlength] = g_SystemParam_Config.DHCP;
			sendbuf_ptr[13 + localIPlength + LocalMASKlength + LocalGATEWAYlength] = 0;
			for(uint8_t i = 1;i < (13 + localIPlength + LocalMASKlength + LocalGATEWAYlength);i ++)
			{
				sendbuf_ptr[13 + localIPlength + LocalMASKlength + LocalGATEWAYlength] += sendbuf_ptr[i];//把AP字符串赋值给config
			}
			
			sendbuf_ptr[14 + localIPlength + LocalMASKlength + LocalGATEWAYlength] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 15 + localIPlength + LocalMASKlength + LocalGATEWAYlength;			
			
			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}


int8_t APP_Report_LowPower(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_LowPower\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_LOWPOWER;
			sendbuf_ptr[2] = 0x08;  //8个字节长度
			sendbuf_ptr[3] = 0x00;
			sendbuf_ptr[4] = g_SystemParam_Config.Lowpower_Mode; //两个，一个温度一个加速度	
			sendbuf_ptr[5] = g_SystemParam_Config.scan_channel;
			sendbuf_ptr[6] = g_SystemParam_Config.Waitforsleeptime;
			sendbuf_ptr[7] = g_SystemParam_Config.WaitforIEPEtime;
			sendbuf_ptr[8] = 0;
			sendbuf_ptr[9] = 0;
			sendbuf_ptr[10] = 0;
			sendbuf_ptr[11] = 0;
			sendbuf_ptr[12] = 0;
			for(uint16_t i = 1;i < 12;i ++)
			{
				sendbuf_ptr[12] += sendbuf_ptr[i];
			}
			
			sendbuf_ptr[13] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = 14;
			
			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
