li59533/YE5955_WiFi/code/stm32l4xx/stm32l4xx/projects/stm32l4xx/source/fml/app_datasend.c
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}


int8_t APP_Report_Scale(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_Scale\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			
			float interscale = 0;
			unsigned char *floatCdata;
			
			uint16_t channelnum = g_SystemParam_Param.acceleration_adchs;  //这边限制通道个数
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_SCALE;   
			sendbuf_ptr[2] = channelnum*17;
			sendbuf_ptr[3] = (channelnum*17) >> 8;   //L
			for(uint8_t i = 0;i < channelnum;i ++)
			{
				sendbuf_ptr[4 + 17 * i] = i;   //V_IP

				sendbuf_ptr[5 + 17 * i] = g_SystemParam_Config.channel_freq[i];
				sendbuf_ptr[6 + 17 * i] = g_SystemParam_Config.channel_freq[i] >> 8; 
				sendbuf_ptr[7 + 17 * i] = g_SystemParam_Config.channel_freq[i] >> 16; 
				sendbuf_ptr[8 + 17 * i] = g_SystemParam_Config.channel_freq[i] >> 24; 		 
				interscale=1.0f / g_SystemParam_Config.floatscale[i];  

				floatCdata = (unsigned char *)&interscale;
				sendbuf_ptr[9 + 17 * i] = *floatCdata;
				sendbuf_ptr[10 + 17 * i] = *(floatCdata + 1);;
				sendbuf_ptr[11 + 17 * i] = *(floatCdata + 2);
				sendbuf_ptr[12 + 17 * i] = *(floatCdata + 3);
				floatCdata = (unsigned char *)&g_SystemParam_Config.alarmgate[i];
				sendbuf_ptr[13 + 17 * i] = *floatCdata;
				sendbuf_ptr[14 + 17 * i] = *(floatCdata + 1);;
				sendbuf_ptr[15 + 17 * i] = *(floatCdata + 2);
				sendbuf_ptr[16 + 17 * i] = *(floatCdata + 3);
				floatCdata = (unsigned char *)&g_SystemParam_Config.floatrange[i];
				sendbuf_ptr[17 + 17 * i] = *floatCdata;
				sendbuf_ptr[18 + 17 * i] = *(floatCdata + 1);;
				sendbuf_ptr[19 + 17 * i] = *(floatCdata + 2);
				sendbuf_ptr[20 + 17 * i] = *(floatCdata + 3);

			}

			sendbuf_ptr[channelnum * 17 + 4] = 0;
			for(uint16_t j = 1;j < (channelnum * 17 + 4);j ++)
			{
				sendbuf_ptr[channelnum * 17 + 4] += sendbuf_ptr[j];
			}
			sendbuf_ptr[channelnum * 17 + 5] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = channelnum * 17 + 6;			
			
			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}


int8_t APP_Report_AlarmValue(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_AlarmValue\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			unsigned char *floatCdata;
			uint16_t channelnum = 17;  //这边限制通道个数
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_ALARMVALUE;   
			sendbuf_ptr[2] = channelnum*4;
			sendbuf_ptr[3] = (channelnum*4)>>8;   //L
			for(uint8_t i = 0;i < channelnum;i ++)
			{
				floatCdata = (unsigned char *)&g_SystemParam_Config.Alarm_value_junyue[i];
				sendbuf_ptr[4 + 4 * i] = *floatCdata;
				sendbuf_ptr[5 + 4 * i] = *(floatCdata+1);
				sendbuf_ptr[6 + 4 * i] = *(floatCdata+2);
				sendbuf_ptr[7 + 4 * i] = *(floatCdata+3);	 
			}

			sendbuf_ptr[channelnum * 4 + 4] = 0;
			for(uint16_t j = 1;j < (channelnum * 4 + 4);j++)
			{
				sendbuf_ptr[channelnum * 4 + 4] += sendbuf_ptr[j];
			}
			sendbuf_ptr[channelnum * 4 + 5] = LNPROTOCOL_STD_FOOT;
			sendbuf_len = channelnum * 4 + 6;
			
			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}






int8_t APP_Report_LowPowerValue(uint8_t channel_type)   // 
{
	if(channel_type == Current_Is_NET)
	{
		if(ESP32_GetWorkSpace() != NULL)
		{
			DEBUG("APP_Report_LowPowerValue\r\n");
			uint8_t * sendbuf_ptr = 0;
			uint16_t sendbuf_len = 0;
			sendbuf_ptr = ESP32_GetWorkSpace();
			
			sendbuf_ptr[0] = LNPROTOCOL_STD_HEAD;
			sendbuf_ptr[1] = LN_P_R_LOWPOWER_VALUE;
			sendbuf_ptr[2] = 0x08;  //8个字节长度
			sendbuf_ptr[3] = 0x00;
			sendbuf_ptr[4] = g_SystemParam_Config.workcycleseconds_inAlarmStatue;
			sendbuf_ptr[5] = g_SystemParam_Config.workcycleseconds_inAlarmStatue>>8;
			sendbuf_ptr[6] = (short)g_SystemParam_Config.tempCompensation;
			sendbuf_ptr[7] = (short)g_SystemParam_Config.tempCompensation>>8;
			sendbuf_ptr[8] = 0;
			sendbuf_ptr[9] = 0;
			sendbuf_ptr[10] = 0;
			sendbuf_ptr[11] = 0;
			sendbuf_ptr[12] = 0;
			for(uint16_t i = 1;i < 12;i++)
			{
				sendbuf_ptr[12] += sendbuf_ptr[i];
			}
			
			sendbuf_ptr[13] = LNPROTOCOL_STD_FOOT;
			sendbuf_len=14;
			
			BSP_ESP32_TX_Enqueue(sendbuf_ptr,  sendbuf_len);
						
		}
		else
		{
			return -1;
		}
	}
	else
	{
		
	}

	return 1;
		
}


void BoardAutoPeroidWave(void)
{ 
	if(ESP32_GetModule_Status(ESP32_MODULE_STATUS) != ESP32_CONNECTED)
	{
		return;
	}

	
	uint8_t checksum = 0;
	uint16_t wpp = 0;
	int16_t sendperioddata = 0;
	uint32_t beforeSAMPLEblock = (currentSAMPLEblock + 1) % 2;;
	int16_t yy;
	int16_t *p;
	uint16_t packege_flag = 0;
	uint16_t buflength = g_SystemParam_Param.periodboardpoints + 1 + 7 + 2;//1个字节通道号 7个字节时间，2个字节包号
	uint8_t * PeriodWaveToSend;
	float inter_factor = 0;
	
	RTC_T rtc_data ;
	
	PeriodWaveToSend = pvPortMalloc(600); //vPortFree()
	rtc_data = BSP_RTC_Get();
	
	for(uint32_t ii = 0;ii < g_SystemParam_Param.acceleration_adchs ; ii ++)
	{
		if(((g_SystemParam_Config.DataToSendChannel >> ii) & 0x01) == 0)  //未使能的通道不发送
		{
			continue;
		}

		switch(ii)
		{
			case 0:
				p=&piz_emu_data[beforeSAMPLEblock][0];
				break;
			case 1:
				p=&mems_emu_data[beforeSAMPLEblock][0][0];
				break;
			case 2:
				p=&mems_emu_data[beforeSAMPLEblock][1][0];
				break;
			default:
			break;
		}
		
		inter_factor = g_SystemParam_Config.floatadc[ii] * g_SystemParam_Config.floatscale[ii] * 1500.0f / g_SystemParam_Config.floatrange[ii];
		
		for(uint32_t i = 0 ; i < g_SystemParam_Config.channel_freq[ii] ; i ++) //*config.ADtime
		{
			yy = *p;
			p ++;
			sendperioddata = (int16_t)(yy * inter_factor);//(int16_t)(yy*Parameter.ReciprocalofRange[ii]);

			PeriodWaveToSend[wpp + 14] = sendperioddata;
			PeriodWaveToSend[wpp + 15] = sendperioddata >>8;
//			checksum += (PeriodWaveToSend[wpp + 14] + PeriodWaveToSend[wpp + 15]);			 
			wpp = wpp + 2;			
			
			if(wpp > (g_SystemParam_Param.periodboardpoints - 1)) 
			{	
				PeriodWaveToSend[0] = 0x7e;//TELid;
				PeriodWaveToSend[1] = 0x70;//TELid>>8;	
				PeriodWaveToSend[2] = buflength;//TELid>>16;
				PeriodWaveToSend[3] = (uint8_t)(buflength>>8);// TELid>>24; //2,3????????482??
				PeriodWaveToSend[4] = ii+1;// TELid>>24;
				PeriodWaveToSend[5] = rtc_data.Year;
				PeriodWaveToSend[6] = rtc_data.Year>>8;
				PeriodWaveToSend[7] = rtc_data.Mon;
				PeriodWaveToSend[8] = rtc_data.Day; //时间用32位表示
				PeriodWaveToSend[9] = rtc_data.Hour;
				PeriodWaveToSend[10] = rtc_data.Min;
				PeriodWaveToSend[11] = rtc_data.Sec; //时间用32位表示		
				PeriodWaveToSend[12] = packege_flag; //时间用32位表示
				PeriodWaveToSend[13] = packege_flag >> 8; //时间用32位表示

				for(uint16_t j = 1; j < g_SystemParam_Param.periodboardpoints + 14 ; j ++)
				{
					checksum += PeriodWaveToSend[j];
				}
				
				PeriodWaveToSend[14+g_SystemParam_Param.periodboardpoints] = checksum;//checksum;  //2,3????????482??
				PeriodWaveToSend[15+g_SystemParam_Param.periodboardpoints] = 0x7e; 
				packege_flag ++;
				
				if(packege_flag > 127)
				{
					DEBUG("packege_flag > 127 \r\n");
				}
				
				BSP_ESP32_TX_Enqueue(PeriodWaveToSend,g_SystemParam_Param.periodboardpoints+16);	

