li59533/YE5955_WiFi/code/stm32l4xx/stm32l4xx/projects/stm32l4xx/source/fml/app_datasend.c
				DEBUG("packege_No %d checksum : 0x%02X\r\n",packege_flag,checksum);
				wpp=0;
				checksum=0;
				
			}
		}
		
		RTOS_Delay_ms(30);
	}
	vPortFree(PeriodWaveToSend);
}




void APP_Report_CharacterValue(void )
{
	uint8_t * sendbuf = 0;
	
	
	
	sendbuf = pvPortMalloc(300); //vPortFree()
	
	
	uint32_t empty_Acceleration_ADCHS=0;   //未发送通道
	RTC_T rtc_data ;
	rtc_data = BSP_RTC_Get();
	
	sendbuf[0]=LNPROTOCOL_STD_HEAD;
	sendbuf[1]=LN_P_R_CHARACTER_VALUE;
	uint32_t 	iii=0;
	uint8_t * floatdata;
	sendbuf[4]=rtc_data.Year;
	sendbuf[5]=rtc_data.Year>>8;
	sendbuf[6]=rtc_data.Mon;
	sendbuf[7]=rtc_data.Day; //时间用32位表示
	sendbuf[8]=rtc_data.Hour;
	sendbuf[9]=rtc_data.Min;
	sendbuf[10]=rtc_data.Sec; //时间用32位表示

	//rule_check();	
	
	for(uint32_t ii = 0 ; ii < g_SystemParam_Param.acceleration_adchs ; ii ++)
	{
		floatdata=(uint8_t *)&g_SystemParam_Param.EffectiveValue[ii];//[0];
		sendbuf[11+25*iii]=*floatdata;
		sendbuf[12+25*iii]=*(floatdata+1);
		sendbuf[13+25*iii]=*(floatdata+2);
		sendbuf[14+25*iii]=*(floatdata+3);
		sendbuf[15+25*iii]=0; //5个参数		
		
		floatdata=(uint8_t *)&g_SystemParam_Param.Vrms[ii];
		sendbuf[16+25*iii]=*floatdata;
		sendbuf[17+25*iii]=*(floatdata+1);
		sendbuf[18+25*iii]=*(floatdata+2);
		sendbuf[19+25*iii]=*(floatdata+3);
		sendbuf[20+25*iii]=0;
		
		
		
		floatdata=(uint8_t *)&g_SystemParam_Param.Drms[ii];
		sendbuf[21+25*iii]=*floatdata;
		sendbuf[22+25*iii]=*(floatdata+1);
		sendbuf[23+25*iii]=*(floatdata+2);
		sendbuf[24+25*iii]=*(floatdata+3);
		sendbuf[25+25*iii]=0;
		
		
			
		floatdata=(uint8_t *)&g_SystemParam_Param.KurtosisIndex[ii];
		sendbuf[26+25*iii]=*floatdata;
		sendbuf[27+25*iii]=*(floatdata+1);
		sendbuf[28+25*iii]=*(floatdata+2);
		sendbuf[29+25*iii]=*(floatdata+3);
		sendbuf[30+25*iii]=0;
		
	
			
		floatdata=(uint8_t *)&g_SystemParam_Param.Envelop[ii];
		sendbuf[31+25*iii]=*floatdata;
		sendbuf[32+25*iii]=*(floatdata+1);
		sendbuf[33+25*iii]=*(floatdata+2);
		sendbuf[34+25*iii]=*(floatdata+3);
		sendbuf[35+25*iii]=0;
		iii++;
	} 
	iii--;
	

	floatdata=(uint8_t *)&g_SystemParam_Param.pdate;
	sendbuf[36+25*2]=*floatdata;
	sendbuf[37+25*2]=*(floatdata+1);
	sendbuf[38+25*2]=*(floatdata+2);
	sendbuf[39+25*2]=*(floatdata+3);
	sendbuf[40+25*2]=0;

	floatdata=(uint8_t *)&g_SystemParam_Config.battery;
	sendbuf[41+25*2]=*floatdata;
	sendbuf[42+25*2]=*(floatdata+1);
	sendbuf[43+25*2]=*(floatdata+2);
	sendbuf[44+25*2]=*(floatdata+3);
	sendbuf[45+25*2]=0;
	
	uint32_t length=85+7;
	sendbuf[2]=(uint8_t)length;
	sendbuf[3]=(uint8_t)(length>>8);
	sendbuf[46+25*2]=0;
	for(uint8_t i=1;i<(46+25*2);i++)
	sendbuf[46+25*2]+=sendbuf[i];
	sendbuf[47+25*2]=0x7e;

	BSP_ESP32_TX_Enqueue(sendbuf,(48+25*2));
	
	vPortFree(sendbuf);
	
}













/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

